announcements/snarf-string-inside-delimiters.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-18 Sat 09:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Snarfing String Within Delimiters  With One Defun</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Snarfing String Within Delimiters  With One Defun</h1>
<div id="outline-container-org86e644c" class="outline-2">
<h2 id="org86e644c"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
I found that  I frequently needed to snarf a string enclosed within
delimiters, e.g., URLs in email messages <span class="underline">&lt;url&gt;</span>,
bolded, italics and other styled text in org-mode etc. I first tried
package <span class="underline">ciel</span> but found that it did not handle all the delimiters I
wanted. However looking into it further revealed that emacs had all
the tools needed to reduce the task to a single <b>defun</b>!
</p>
</div>
</div>

<div id="outline-container-org56f5525" class="outline-2">
<h2 id="org56f5525"><span class="section-number-2">2</span> The Solution</h2>
<div class="outline-text-2" id="text-2">
<p>
Here is the solution I implemented  at
<a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-wizards.el#L3089">emacspeak-wizards-snarf-sexp</a>. invoking this command with  point on
the opening delimiter  snarfs the enclosed string into the
kill-ring; an optional prefix arg clears it as well.
The code below is the same as in the Emacspeak project, but with
emacspeak-specific calls removed:
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">snarf-sexp-contents</span> (<span style="color: #6ae4b9;">&amp;optional</span> delete)
  <span style="color: #b0d6f5;">"Snarf the contents between delimiters at point.</span>
<span style="color: #b0d6f5;">Optional interactive prefix arg deletes it."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  (<span style="color: #b6a0ff;">let</span> ((orig (point))
        (pair nil)
        (pairs <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">The delimiter pairs:</span>
         '((?&lt; ?&gt;)
           (?\[ ?\])
           (?\( ?\))
           (?{ ?})
           (?\" ?\")
           (?' ?')
           (?` ?')
           (?| ?|)
           (?* ?*)
           (?/ ?/)
           (?- ?-)
           (?_ ?_)
           (?~ ?~)))
        (char (char-after))
        (stab nil)) <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Syntax table we  use</span>
    (<span style="color: #b6a0ff;">unless</span> (<span style="color: #b6a0ff;">setq</span> pair (assoc char pairs)) <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Not on a delimiter </span>
      (<span style="color: #dbbe5f;">error</span> <span style="color: #79a8ff;">"Point is not on a supported delimiter"</span>))
    (<span style="color: #b6a0ff;">setq</span> stab (copy-syntax-table))
    (<span style="color: #b6a0ff;">with-syntax-table</span> stab
      (<span style="color: #b6a0ff;">cond</span>
       ((= (cl-first pair) (cl-second pair)) <span style="color: #a8a8a8;">;;;</span><span style="color: #a8a8a8;">Like quotes</span>
        (modify-syntax-entry (cl-first pair) <span style="color: #79a8ff;">"\""</span> ) 
        (modify-syntax-entry (cl-second pair) <span style="color: #79a8ff;">"\""</span> ))
       (t<span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Like parens </span>
        (modify-syntax-entry (cl-first pair) <span style="color: #79a8ff;">"("</span>)
        (modify-syntax-entry (cl-second pair) <span style="color: #79a8ff;">")"</span>)))
      (<span style="color: #b6a0ff;">save-excursion</span><span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">We have our sexp </span>
        (forward-sexp) <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Will error out if delims dont match</span>
        (<span style="color: #b6a0ff;">cond</span>
         (delete <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Clear sexp contents </span>
          (kill-region (1+ orig) (1- (point))))
         (t <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">Copy sexp contents</span>
             (kill-ring-save (1+ orig) (1- (point)))))))))

</pre>
</div>
</div>


<div id="outline-container-org828c705" class="outline-3">
<h3 id="org828c705"><span class="section-number-3">2.1</span> Key Take-Aways</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>S-expressions are a key Emacs concept with extensive built-in support.</li>
<li>S-expressions are determined by matching delimiters.</li>
<li>Delimiters are defined by the syntax-table in effect.</li>
<li>Emacs-lisp primitives let us define and manipulate temporary syntax-tables.</li>
<li>Putting it all together, the underlying task of snarfing the
contents within a pair of delimiters reduces to a few calls to
the underlying primitives.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-09-18 Sat 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2021-09-18 Sat 09:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
